{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Billing and Payments",
    "1": "Customer Service",
    "2": "General Inquiry",
    "3": "Human Resources",
    "4": "IT Support",
    "5": "Product Support",
    "6": "Returns and Exchanges",
    "7": "Sales and Pre-Sales",
    "8": "Service Outages and Maintenance",
    "9": "Technical Support"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Billing and Payments": 0,
    "Customer Service": 1,
    "General Inquiry": 2,
    "Human Resources": 3,
    "IT Support": 4,
    "Product Support": 5,
    "Returns and Exchanges": 6,
    "Sales and Pre-Sales": 7,
    "Service Outages and Maintenance": 8,
    "Technical Support": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
